{
    "acceuil":{
        "home":"home",
        "about":"about",
        "features": "features",
        "Bcreate":"create account",
        "title_part1": "A",
    "title_part2": "Smarter Way",
    "title_part3": "To Learn",
  
    "title_part4": "C",
    "title_part5": "and Algorithms",
     "p_heroS":"Empowering Students And Teachers To Learn, Teach, And Collaborate Around C Programming",
        "button_start": "Get Started",
        "button_work":"How It Works",

      

"aboutTitle": "About CONNECT",
    "aboutParagraph1": "Founded in 2025, CONNECT was created by software engineers passionate about making programming education accessible and effective for everyone.",
    "aboutParagraph2": "We believe that learning to code should be engaging, interactive, and personalized. Our platform combines cutting-edge educational technology with proven teaching methods to create an unparalleled learning experience.",
    "aboutParagraph3": "With thousands of students and educators using our platform daily, we're committed to continuously improving and expanding our offerings to meet the evolving needs of the programming education community.",
    "missionTitle": "Our Mission",
    "missionText": "To empower the next generation of programmers with the skills and confidence they need to succeed in the digital world.",
    "valuesTitle": "Our Values",
    "valuesText": "Excellence in education, inclusivity, innovation, and a student-first approach guide everything we do.",
    "visionTitle": "Our Vision",
    "visionText": "A world where quality programming education is accessible to everyone, regardless of background or location.",

















        "whyChoose": "Why Choose CONNECT?",
    "whyChooseText": "We provide the tools and resources you need to master C programming and algorithms effectively",
    "structuredCourses": "STRUCTURED COURSES",
    "structuredCoursesText": "Progressive and well-organized lessons to master fundamental concepts.",
    "personalizedTracking": "PERSONALIZED TRACKING",
    "personalizedTrackingText": "Track your progress and identify your strengths and areas for improvement.",
    "accessibleEveryone": "ACCESSIBLE TO EVERYONE",
    "accessibleEveryoneText": "A platform designed for all levels — from beginners to experts.",
    "integratedAI": "INTEGRATED AI",
    "integratedAIText": "AI-powered guidance that adapts to your level, helping you learn faster and understand complex concepts with clarity.",
    "gamification": "GAMIFICATION",
    "gamificationText": "Boost your learning with interactive challenges, achievements, and rewards that turn your progress into a game.",
    "forumsCollaboration": "FORUMS FOR COLLABORATION",
    "forumsCollaborationText": "Collaborate, exchange ideas, and get help through dedicated forums connecting students and teachers.",

















     "copyright": "Copyright ©2025",
    "all_rights": "|| all right reserved",
    "footer_policy": "Confidentiality Policy"


    }
}